Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Find the indices of all ocurrences of a search query between two points in a 1D or 2D array using _ArraySearch()
fr: Trouve les index de toutes les occurrences d'une requête de recherche entre deux points d'un tableau 1D ou 2D en utilisant _ArraySearch()

source: The array to search
fr: Le tableau dans lequel lancer la recherche

source: What to search $aArray for
fr: La valeur à rechercher dans $aArray

source: Index of array to start search
fr: Index du tableau où commencer la recherche

source: Index of array to end search
fr: Index du tableau où finir la recherche

source: If set to 1, search is case sensitive
fr: Si la valeur est 1, la recherche est sensible à la casse

source: 0 - AutoIt variables compare (default), "string" = 0, "" = 0 or "0" = 0 match
fr: 0 - Compare les variables AutoIt (par défaut), "string" = 0, "" = 0 ou "0" = 0 réalise l'égalité

source: 1 - Executes a partial search (StringInStr)
fr: 1 - Exécute une recherche partielle (StringInStr)

source: 2 - Comparison match if variables have same type and same value
fr: 2 - La comparaison réussie si les variables ont le même type et la même valeur

source: Sub-index to search on in 2D arrays
fr: Sous-index pour rechercher dans des tableaux 2D

source: If True then $iSubItem sets the row to search - False (default) searches columns
fr: Si True, $iSubItem définit la ligne où rechercher - False (par défaut) recherche dans la colonne

source: an array of all index numbers in array containing $vValue.
fr: Retourne le tableau de tous les index du tableau initial contenant $vValeur.

source: sets the @error flag to non-zero (see _ArraySearch() description for @error).
fr: Retourne @error <> 0 (consultez _ArraySearch() pour une description de @error ).

source: Insert a new value at the specified position of a 1D or 2D array
fr: Insère une nouvelle valeur à la position spécifiée d'un tableau 1D ou 2D

source: Position(s) at which to insert item(s) - see Remarks for format
fr: Position(s) à laquelle insérer l'élément(s) - voir Remarques pour le format

source: Value(s) to add - can be a single variable, a delimited string or a 1D array
fr: Valeur(s) à ajouter - peut être une variable unique, une chaîne morcellée (par le séparateur $sDelim_Item) ou un tableau 1D

source: Column in which insert is to begin (2D array only)
fr: Colonne dans laquelle l'insertion doit commencer (tableau 2D uniquement)

source: Variable to which a datatype function (e.g.Number, HWnd) has been assigned.
fr: Variable dans laquelle une fonction "type de données" (par exemple, Nombre, HWnd ) a été assignée.

source: If $vValue is a delimited string, forces items into that datatype.
fr: Si $vValeur est une chaîne morcellée, force les éléments dans ce type de données.

source: the new size of the array.
fr: Retourne la nouvelle taille du tableau.

source: 0 and sets the @error flag to non-zero.
fr: Retourne 0 et @error <> 0.

source: 3 - $vRange incorrectly formatted (incorrect character or unordered)
fr: 3 - $vRange a un format incorrect (caractère incorrect ou non ordonnée)

source: 5 - $vRange limits outside array bounds
fr: 5 - $vRange a des limites en dehors des limites du tableau

source: 6 - $iStart outside array bounds (2D only)
fr: 6 - $istart est en dehors des limites du tableau (2D uniquement)

source: 7 - $vValue not 2D array (2D only)
fr: 7 - $vValeur n'est pas un tableau 2D (2D uniquement)

source: 8 - $vValue has too many columns to fit into $aArray
fr: 8 - $vValeur a trop de colonnes pour s'adapter à $aArray

source: $vRange can be a string containing the rows above which a row is to to be inserted.
fr: $vRange peut être une chaîne contenant les lignes avant lesquelles une ligne doit être insérée.

source: $vRange can also be a 1D array containing the rows above which a row is to to be inserted with the count in the [0] element].
fr: $vRange peut aussi être un tableau 1D contenant les lignes avant lesquelles une ligne doit être insérée avec le nombre d'éléments dans l'élément [0].

source: In either case, the rows must be in ascending order but can be duplicated.
fr: Dans les deux cas, les lignes doivent être en ordre croissant, mais peuvent être dupliquées.

source: If $vValue is a delimited string all items are inserted into the array as strings.
fr: Si $vValeur est une chaîne morcellée tous les éléments sont insérés dans le tableau sous forme de chaînes.

source: Insertion mode depends on $vValue type:
fr: Le mode d'insertion dépend du type $vValeur :

source: Single item - inserts 1 element containing $vValue
fr: Un seul élément - insère 1 élément contenant $vValeur

source: $sDelim_Item delimited string - matches insertion lines to items in the string
fr: Chaîne morcellée par $sDelim_Item - correspond à des lignes d'insertion pour les éléments de la chaîne 'splitée'

source: 0-based 1D array - matches insertion lines to elements in the array
fr: Tableau 1D de base 0 - correspond à des lignes d'insertion des éléments du tableau

source: Single item - inserts 1 row containing $vValue in the first column
fr: Un seul élément - insère 1 ligne contenant $vValeur dans la première colonne

source: $sDelim_Item delimited string - inserts 1 row at first insertion line, columns filled if enough items
fr: Chaîne morcellée par $sDelim_Item - insère 1 ligne à la première ligne d'insertion, les colonnes sont remplies si il y a suffisamment d'éléments

source: $sDelim_Row delimited string - matches insertion lines to items in the string, only 1 column filled
fr: Chaîne morcellée par $sDelim_Row - Les lignes insérées sont les éléments de la chaîne, seulement 1 colonne est remplie

source: Double-delimited string - matches insertion lines to string split on $sDelim_Row, columns to string split on $sDelim_Item
fr: Chaîne doublement morcellée - les lignes insérées sont les éléments de la chaîne découpée suivant $sDelim_Row, les colonnes sont les éléments de la chaîne découpée suivant $sDelim_Item

source: 0-based 2D array - matches insertion lines to rows in the array, columns to columns in the array
fr: Tableau 2D de base 0 - fait correspondre les lignes d'insertion aux lignes du tableau, et les colonnes d'insertion aux colonnes du tableau

source: An empty string ("") is inserted if there are insufficient items specified in $vValue.
fr: Une chaîne vide ("") est insérée si il n'y a pas suffisamment d'éléments spécifiés dans $vValeur.

source: Insert single item
fr: Insére un élément unique

source: Insert delimited string using range array
fr: Insére une chaîne morcellée en utilisant une plage du tableau

source: Insert 1D array using range string
fr: Insére un tableau 1D en utilisant une plage de chaîne

source: Insert single item in defined column
fr: Insére un seul élément dans une colonne définie

source: Insert item delimited string - inserted as 1 row - other rows filled with ""
fr: Insére un élément d'une chaîne morcellée - inséré comme une ligne - les autres lignes sont remplies avec ""

source: Insert row delimited string using range array - inserted as 3 rows, other cols filled with ""
fr: Insére une ligne d'une chaîne morcellée en utilisant une plage du tableau - inséré comme 3 lignes, les autres colonnes sont remplis avec ""

source: Insert in column 2
fr: Insére dans la colonne 2

source: Insert item as row delimited string - inserted as 4 rows
fr: Insére un élément comme ligne d'une chaîne morcellée - inséré comme 4 lignes

source: Insert 2D array
fr: Insére un tableau 2D

source: Returns the highest value held in a 1D or 2D array
fr: Retourne la valeur la plus grande d'un tableau 1D ou 2D

source: Array to search
fr: Tableau à traiter

source: Comparison method:
fr: Méthode de comparaison :

source: 0 - compare alphanumerically
fr: 0 - comparaison alphanumérique

source: 1 - compare numerically
fr: 1 - comparaison numérique

source: Column of array to search
fr: Colonne de tableau où rechercher

source: the maximum value in the array.
fr: Retourne la valeur maximale du tableau.

source: sets the @error flag to non-zero (see _ArrayMaxIndex() description for @error).
fr: Retourne @error <> 0 (voir _ArrayMaxIndex() pour une description de @error ).

source: Returns the index where the highest value occurs in a 1D or 2D array
fr: Retourne l'index de la valeur la plus élevée d'un tableau 1D ou 2D

source: the index of the maximum value in the array.
fr: Retourne l'index de la valeur maximale du tableau.

source: 3 - $iStart or $iEnd outside array bounds
fr: 3 - $iStart ou $iEnd en dehors des limites du tableau

source: 4 - $iStart is greater than $iEnd
fr: 4 - $iStart est supérieure à $iEnd

source: 5 - $aArray is empty
fr: 5 - $aArray est vide

source: 6 - $iSubItem outside array bounds
fr: 6 - $iSubItem est en dehors des limites du tableau

source: Returns the lowest value held in a 1D or 2D array
fr: Retourne la valeur la plus petite d'un tableau 1D ou 2D

source: the minimum value in the array.
fr: Retourne la valeur minimum du tableau.

source: sets the @error flag to non-zero (see _ArrayMinIndex() description for @error).
fr: Retourne @error <> 0 (voir _ArrayMinIndex() pour une description de @error ).

source: Returns the index where the lowest value occurs in a 1D or 2D array
fr: Retourne l'index de la valeur la plus petite d'un tableau 1D ou 2D

source: the index of the minimum value in the array.
fr: Retourne l'index de la valeur minimum du tableau.

source: Returns an array of the Permutations of all Elements in a 1D array
fr: Retourne un tableau des permutations de tous les éléments d'un tableau 1D

source: The Array to get Permutations
fr: Le tableau dont les éléments sont à permuter.

source: String result separator, default is "" for none
fr: Séparateur à utiliser dans les chaînes résultats , par défaut est "" pour aucun séparateur.

source: an array of Permutations.
fr: Retourne un tableau de permutations.

source: $aArray[0] contains the number of strings returned.
fr: $aArray[0] contient le nombre de chaînes renvoyées.

source: The remaining elements ($aArray[1], $aArray[2] ...
fr: Les autres éléments ($aArray[1], $aArray[2], ...

source: $aArray[n]) contain the Permutations.
fr: $aArray[n]) contiennent les permutations sous forme de chaînes.

source: 1 - The Input Must be an Array
fr: 1 - L'entrée doit être un tableau

source: 2 - $aArray is not a 1 dimensional array
fr: 2 - $aArray n'est pas un tableau 1D

source: The input array must be 0-based, i.e. no counter in $aArray[0].
fr: Le tableau d'entrée doit être de base 0, c'est à dire qu'il ne doit pas y avoir le nombre d'éléments dans $aArray[0].

source: Based on the algorithm by Alexander Bogomolny (http://www.bearcave.com/random_hacks/permute.html).
fr: Sur la base de l'algorithme de Alexander Bogomolny ( http://www.bearcave.com/random_hacks/permute.html ).

source: Declare a 1-dimensional array, return an Array of permutations
fr: Déclare un tableau 1D, retourne le tableau des permutations

source: Using Default Parameters
fr: Utilisation des paramètres par défaut

source: Returns the last element of an array, deleting that element from the array at the same time
fr: Retourne le dernier élément d'un tableau, en supprimant cet élément du tableau en même temps

source: the last element of the array (see remarks).
fr: Retourne le dernier élément du tableau (voir Remarque).

source: 1 - The Input Must be an array
fr: 1 - L'entrée doit être un tableau

source: 2 - $aArray is not a 1D array
fr: 2 - $aArray n'est pas un tableau 1D

source: 3 - $aArray is empty
fr: 3 - $aArray est vide

source: If $aArray has one element left, it will be set to "" after _ArrayPop() is used on it.
fr: Si $aArray n'a qu'un élément, il sera défini à "" après que _ArrayPop() ait été exécuté.

source: Add new values without increasing array size by inserting at the end the new value and deleting the first one or vice versa
fr: Insère de nouvelles valeurs à la fin en supprimant autant de valeurs au début (taille inchangée) ou inversement

source: Value(s) to add (can be in an array)
fr: Valeur(s) à insérer (peut être dans un tableau)

source: Direction to push existing array elements:
fr: Direction du glissement des éléments du tableau:

source: 0 = Slide left (adding at the end)
fr: 0 = glissement vers la gauche (insertion à la fin)

source: 1 = Slide right (adding at the start)
fr: 1 = glissement vers la droite (insertion au début)

source: 2 - $vValue is an array larger than $aArray (so it can't fit)
fr: 2 - $vValeur est un tableau plus grand que $aArray (il ne peut pas s'adapter)

source: 3 - $aArray is not a 1D array
fr: 3 - $aArray n'est pas un tableau 1D

source: This function is used for continuous updates of data in array, where in other cases a vast size of array would be created.
fr: Cette fonction est utilisée pour les mises à jour en continu des données d'un tableau, ou sinon un tableau de grande taille serait créé.

source: It keeps all values inside the array (something like History), minus the first one or the last one depending on direction chosen.
fr: Il conserve toutes les valeurs à l'intérieur du tableau (quelque chose comme History), moins les premiers ou les derniers, selon la direction choisie.

source: It is similar to the push command in assembly.
fr: La fonction est similaire à la commande 'push' en assembleur.

source: Takes the given array and reverses the order in which the elements appear in a 1D array
fr: Prend un tableau 1D et inverse l'ordre dans lequel les éléments apparaissent

source: Index of array to start modifying at
fr: Index du tableau où commencer l'inversion

source: Index of array to stop modifying at
fr: Index du tableau où arrêter l'inversion

source: 2 - $iStart is greater than $iEnd
fr: 2 - $iStart est supérieure à $iEnd

source: 4 - $aArray is empty
fr: 4 - $aArray est vide

source: Finds an entry within a 1D or 2D array.
fr: Cherche une valeur dans un tableau 1D ou 2D.

source: Similar to _ArrayBinarySearch(), except that the array does not need to be sorted
fr: Similaire à _ArrayBinarySearch(), sauf que le tableau n'a pas besoin d'être trié

source: Index of array to start searching at
fr: Index du tableau où commencer la recherche

source: Index of array to stop searching at
fr: Index du tableau où arrêter la recherche

source: 0 Casting of variables to the same type (default), "string" = 0, "" = 0 or "0" = 0 match (If $iCase = 0)
fr: 0 - Convertit les variables dans le même type (par défaut), "string" = 0, "" = 0 ou "0" = 0 (si $iCase = 0)

source: 1 executes a partial search
fr: 1 - exécute une recherche partielle

source: 2 comparison match if variables have same type and same value
fr: 2 - la comparaison retourne true si les variables ont le même type et la même valeur

source: 3 compares using a regular expression pattern provided as $vValue
fr: 3 - la comparaison utilise un modèle d'expression régulière fourni par $vValeur

source: If set to 0, searches the array from end to beginning (instead of beginning to end)
fr: Si défini à 0, la recherche dans le tableau se fait de la fin au début (au lieu du début à la fin)

source: the index that $vValue was found at.
fr: Retourne l'index où $vValeur a été trouvé.

source: 5 - Array not 2D and $bRow set True
fr: 5 - Le tableau n'est pas 2D et $bRow est à true

source: 6 - $vValue was not found in array
fr: 6 - $vValeur n'a pas été trouvée dans le tableau

source: This function is likely to be slower than _ArrayBinarySearch() but is useful when the array cannot be sorted before the search.
fr: Cette fonction est susceptible d'être plus lente que _ArrayBinarySearch() mais est utile lorsque le tableau ne peut pas être trié avant la recherche.

source: Search by column (looking in col 2)
fr: Recherche par colonne (en regardant dans la colonne 2)

source: Search by row (looking in row 3)
fr: Recherche par rangée (en regardant la ligne 3)

source: using a 2D array
fr: Utilisation d'un tableau 2D

source: Shuffles selected rows of 1D or 2D arrays - can be limited to a specific column in 2D arrays
fr: Permute aléatoirement les lignes d'un tableau 1D ou 2D.Dans un tableau 2D, peut limiter la permutation à une colonne spécifique

source: Start row for shuffle - default first
fr: Index de la ligne où commencer le mélange - par défaut la première

source: End row for shuffle - default last
fr: Index de la ligne où arrêter le mélange - par défaut la dernière

source: Specific column to shuffle (2D only)
fr: Index de la colonne à mélanger (2D uniquement)

source: 4 - $iStart greater than $iEnd
fr: 4 - $iStart supérieur à $iEnd

source: 5 - $iColumn is outside array bounds
fr: 5 - $iColumn en dehors des limites du tableau

source: The function uses the Fisher-Yates shuffle algorithm.
fr: La fonction utilise l'algorithme de permutation aléatoire Fisher-Yates.

source: Sort a 1D or 2D array on a specific index using the dualpivotsort/quicksort/insertionsort algorithms
fr: Trie un tableau 1D ou 2D sur une colonne spécifique en utilisant les algorithmes DualPivotSort/QuickSort/InsertionSort

source: Array to sort
fr: Tableau à trier

source: If set to 1, sort descendingly
fr: Si défini à 1, tri décroissant

source: Index of array to start sorting at
fr: Index du tableau où commencer le tri

source: Index of array to stop sorting at
fr: Index du tableau où arrêter le tri

source: Sub-index to sort on in 2D arrays
fr: Sous-index pour trier dans des tableaux 2D

source: Use pivot sort algorithm - default algorithm = quicksort
fr: Utilise l'algorithme du pivot - par défaut, QuickSort

source: 3 - $iSubItem is greater than subitem count
fr: 3 - $iSubItem est plus grand que le nombre de sous-items

source: 4 - $aArray is not a 1D or 2D array
fr: 4 - $aArray n'est pas un tableau 1D ou 2D

source: 6 - $iPivot used with 2D array
fr: 6 - $iPivot utilisé avec un tableau 2D

source: By default the UDF uses a QuickSort algorithm to sort the array.
fr: Par défaut, la fonction utilise l'algorithme QuickSort pour trier le tableau.

source: Setting the $iPivot parameter uses a DualPivotSort algorithm on 1D arrays - this can be significantly faster for large arrays (> 50 elements) - but sorting 2D arrays with this algorithm is very much slower and the UDF will return an error in this case.
fr: Définissez le paramètre $iPivot pour utiliser l'algorithme du DualPivotSort sur un tableau 1D - cela peut être beaucoup plus rapide pour des grands tableaux (> 50 éléments) - mais le tri des tableaux 2D avec cet algorithme est très lent et la fonction retournera une erreur dans ce cas.

source: In both algorithms, relatively short arrays will be sorted using an insertion sort (< 15 elements with QuickSort; < 45 elements with Dual PivotSort).
fr: Dans les deux algorithmes, des tableaux relativement courts seront triés à l'aide d'un tri par insertion (< 15 éléments avec QuickSort; < 45 éléments avec Dual PivotSort).

source: Note that there is no guarantee that a specific algorithm will be faster in a given case.
fr: Notez qu'il n'y a aucune garantie qu'un algorithme spécifique soit plus rapide dans un cas donné.

source: using a 1D array
fr: Tri d'un tableau 1D

source: Swaps full or part columns/rows within a 1D or 2D array
fr: Echange complet ou partiel de deux lignes ou deux colonnes dans un tableau 1D ou 2D

source: Index of first column/row to swap
fr: Index de la première colonne/ligne à échanger

source: Index of second column/row to swap
fr: Index de la seconde colonne/ligne à échanger

source: If True then indices refer to rows; if False (default) indices refer to columns
fr: Si True, les index font référence à des lignes; si False (par défaut) les index font référence à des colonnes

source: Index in column/row to start swap
fr: Index dans la colonne/ligne pour démarrer l'échange

source: Index in column/row to end swap
fr: Index dans la colonne/ligne pour arrêter l'échange

source: 3 - $iIndex_1 or $iIndex_2 is outside array bounds
fr: 3 - $iIndex_1 ou $iIndex_2 en dehors des limites du tableau

source: 4 - $iStart or $iEnd outside array bounds
fr: 4 - $iStart ou $iEnd en dehors des limites du tableau

source: 5 - $iStart is greater than $iEnd
fr: 5 - $iStart est supérieur à $iEnd

source: Sends the contents of a 1D or 2D array to the clipboard, each element separated by a specified delimiter
fr: Envoie le contenu d'un tableau 1D ou 2D dans le presse-papier, chaque élément étant séparé par un séparateur spécifié

source: Array to copy to clipboard
fr: Tableau à copier dans le presse papier

source: Delimiter for elements of 1D array or columns of 2D array
fr: Délimiteur des éléments du tableau 1D ou des colonnes du tableau 2D

source: Index of array row to start copy
fr: Index de ligne du tableau où commencer la copie

source: Index of array row to stop copy
fr: Index de ligne du tableau où arrêter la copie

source: Delimiter for rows of 2D array (2D only)
fr: Délimiteur des lignes du tableau 2D (2D uniquement)

source: Index of array column to start copy (2D only)
fr: Index de colonne du tableau où commencer la copie (2D uniquement)

source: Index of array column to stop copy (2D only)
fr: Index de colonne du tableau où arrêter la copie (2D uniquement)

source: -1 - ClipPut() failed
fr: -1 - ClipPut() a échoué

source: Other - See _ArrayToString() description for @error
fr: Autre - voir _ArrayToString() pour la description de @error

source: Places the elements of a 1D or 2D array into a single string, separated by the specified delimiters
fr: Place les éléments d'un tableau 1D ou 2D dans une seule chaîne, séparés par des séparateurs spécifiés

source: Array to convert to a string
fr: Tableau à convertir en chaîne

source: a string which combined selected elements separated by the delimiters.
fr: Retourne une chaîne qui combine des éléments sélectionnés séparés par des séparateurs.

source: Transposes a 1D or 2D array (swaps rows and columns)
fr: Transpose un tableau 1D ou 2D (échange lignes et colonnes)

source: 1 - $aArray is not a 1D or 2D array
fr: 1 - $aArray n'est pas un tableau 1D ou 2D

source: 2 - $aArray is not an array
fr: 2 - $aArray n'est pas un tableau

source: Trims a certain number of characters from all elements in a 1D or 2D array
fr: Coupe un nombre donné de caractères dans tous les éléments d'un tableau 1D ou 2D

source: Number of characters to remove
fr: Nombre de caractères à supprimer

source: Direction to trim:
fr: Emplacement de la coupe:

source: 0 - trim left
fr: 0 - coupe au début des chaînes

source: 1 - trim right
fr: 1 - coupe à la fin des chaînes

source: Index of array to start trim
fr: Index du tableau où commencer la coupe

source: Index of array to stop trim
fr: Index du tableau où arrêter la coupe

source: Column to trim
fr: Colonne dans laquelle effectuer la coupe

source: 2 - $aArray is not an 1D or 2D array
fr: 2 - $aArray n'est pas un tableau 1D ou 2D

source: 5 - $iSubItem outside array bounds
fr: 5 - $iSubItem est en dehors des limites du tableau

source: Returns the Elements from a column of a 1D or 2D array, removing all duplicates
fr: Retourne les éléments d'une colonne d'un tableau 1D ou 2D, en supprimant tous les doublons

source: The Array to use
fr: Le tableau à traiter

source: 0-based column to be used - default 0.(2D only)
fr: Index de base 0 de la colonne à utiliser - par défaut 0 (2D uniquement)

source: The array is 0-based or 1-based.
fr: Le tableau est de base 0 ou 1.

source: Default 0 :0-based.
fr: Par défaut, de base 0.

source: Flag to indicate if the operations should be case sensitive.
fr: Indicateur signalant si les opérations doivent être sensibles à la casse.

source: Default 0 : not case sensitive.
fr: Par défaut 0 : insensible à la casse.

source: Flag to indicate whether the count of returned elements should be returned in the [0] element.
fr: Indicateur signalant que le nombre d'éléments retournés doit être retourné dans l'élément [0].
